; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_80)

(:domain logistics)

(:objects
	obj0 obj3 obj5 - airport
	obj1 obj4 obj6 - city
	obj2 obj7 obj10 - truck
	obj8 obj12 obj13 obj16 obj18 obj20 obj21 - package
	obj9 obj11 obj15 obj19 obj22 - location
	obj14 obj17 - airplane
)

(:init
	(at obj2 obj0)
	(at obj7 obj3)
	(at obj8 obj5)
	(at obj10 obj5)
	(at obj12 obj0)
	(at obj13 obj3)
	(at obj14 obj5)
	(at obj16 obj11)
	(at obj17 obj5)
	(at obj18 obj5)
	(at obj20 obj5)
	(at obj21 obj5)
	(in-city obj0 obj1)
	(in-city obj3 obj4)
	(in-city obj5 obj6)
	(in-city obj9 obj4)
	(in-city obj11 obj1)
	(in-city obj15 obj4)
	(in-city obj19 obj1)
	(in-city obj22 obj1)
)

(:goal (and
	(at obj8 obj9)
	(at obj12 obj15)
	(at obj13 obj15)
	(at obj16 obj11)
	(at obj18 obj22)
	(at obj20 obj19)
	(at obj21 obj22)
))
)

; plan
1. (drive obj2 obj0 obj11)
   deleted: (at obj2 obj0)
   added: (at obj2 obj11)
   goals met: 1 of 7
2. (load obj14 obj8 obj5)
   deleted: (at obj8 obj5)
   added: (in obj8 obj14)
   goals met: 1 of 7
3. (load obj17 obj18 obj5)
   deleted: (at obj18 obj5)
   added: (in obj18 obj17)
   goals met: 1 of 7
4. (load obj17 obj20 obj5)
   deleted: (at obj20 obj5)
   added: (in obj20 obj17)
   goals met: 1 of 7
5. (load obj17 obj21 obj5)
   deleted: (at obj21 obj5)
   added: (in obj21 obj17)
   goals met: 1 of 7
6. (load obj7 obj13 obj3)
   deleted: (at obj13 obj3)
   added: (in obj13 obj7)
   goals met: 1 of 7
7. (drive obj7 obj3 obj15)
   deleted: (at obj7 obj3)
   added: (at obj7 obj15)
   goals met: 1 of 7
8. (fly obj14 obj5 obj0)
   deleted: (at obj14 obj5)
   added: (at obj14 obj0)
   goals met: 1 of 7
9. (fly obj17 obj5 obj0)
   deleted: (at obj17 obj5)
   added: (at obj17 obj0)
   goals met: 1 of 7
10. (drive obj2 obj11 obj19)
   deleted: (at obj2 obj11)
   added: (at obj2 obj19)
   goals met: 1 of 7
11. (load obj14 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj14)
   goals met: 1 of 7
12. (unload obj7 obj13 obj15)
   deleted: (in obj13 obj7)
   added: (at obj13 obj15)
   goals met: 2 of 7
13. (drive obj7 obj15 obj9)
   deleted: (at obj7 obj15)
   added: (at obj7 obj9)
   goals met: 2 of 7
14. (drive obj2 obj19 obj0)
   deleted: (at obj2 obj19)
   added: (at obj2 obj0)
   goals met: 2 of 7
15. (drive obj7 obj9 obj15)
   deleted: (at obj7 obj9)
   added: (at obj7 obj15)
   goals met: 2 of 7
16. (drive obj7 obj15 obj3)
   deleted: (at obj7 obj15)
   added: (at obj7 obj3)
   goals met: 2 of 7
17. (fly obj17 obj0 obj3)
   deleted: (at obj17 obj0)
   added: (at obj17 obj3)
   goals met: 2 of 7
18. (drive obj2 obj0 obj11)
   deleted: (at obj2 obj0)
   added: (at obj2 obj11)
   goals met: 2 of 7
19. (drive obj7 obj3 obj9)
   deleted: (at obj7 obj3)
   added: (at obj7 obj9)
   goals met: 2 of 7
20. (fly obj14 obj0 obj5)
   deleted: (at obj14 obj0)
   added: (at obj14 obj5)
   goals met: 2 of 7
21. (drive obj2 obj11 obj0)
   deleted: (at obj2 obj11)
   added: (at obj2 obj0)
   goals met: 2 of 7
22. (drive obj7 obj9 obj3)
   deleted: (at obj7 obj9)
   added: (at obj7 obj3)
   goals met: 2 of 7
23. (fly obj14 obj5 obj3)
   deleted: (at obj14 obj5)
   added: (at obj14 obj3)
   goals met: 2 of 7
24. (fly obj17 obj3 obj0)
   deleted: (at obj17 obj3)
   added: (at obj17 obj0)
   goals met: 2 of 7
25. (unload obj14 obj12 obj3)
   deleted: (in obj12 obj14)
   added: (at obj12 obj3)
   goals met: 2 of 7
26. (unload obj14 obj8 obj3)
   deleted: (in obj8 obj14)
   added: (at obj8 obj3)
   goals met: 2 of 7
27. (unload obj17 obj18 obj0)
   deleted: (in obj18 obj17)
   added: (at obj18 obj0)
   goals met: 2 of 7
28. (unload obj17 obj20 obj0)
   deleted: (in obj20 obj17)
   added: (at obj20 obj0)
   goals met: 2 of 7
29. (unload obj17 obj21 obj0)
   deleted: (in obj21 obj17)
   added: (at obj21 obj0)
   goals met: 2 of 7
30. (fly obj14 obj3 obj5)
   deleted: (at obj14 obj3)
   added: (at obj14 obj5)
   goals met: 2 of 7
31. (fly obj14 obj5 obj0)
   deleted: (at obj14 obj5)
   added: (at obj14 obj0)
   goals met: 2 of 7
32. (fly obj17 obj0 obj5)
   deleted: (at obj17 obj0)
   added: (at obj17 obj5)
   goals met: 2 of 7
33. (load obj2 obj18 obj0)
   deleted: (at obj18 obj0)
   added: (in obj18 obj2)
   goals met: 2 of 7
34. (load obj2 obj20 obj0)
   deleted: (at obj20 obj0)
   added: (in obj20 obj2)
   goals met: 2 of 7
35. (load obj2 obj21 obj0)
   deleted: (at obj21 obj0)
   added: (in obj21 obj2)
   goals met: 2 of 7
36. (load obj7 obj12 obj3)
   deleted: (at obj12 obj3)
   added: (in obj12 obj7)
   goals met: 2 of 7
37. (load obj7 obj8 obj3)
   deleted: (at obj8 obj3)
   added: (in obj8 obj7)
   goals met: 2 of 7
38. (drive obj2 obj0 obj19)
   deleted: (at obj2 obj0)
   added: (at obj2 obj19)
   goals met: 2 of 7
39. (drive obj7 obj3 obj15)
   deleted: (at obj7 obj3)
   added: (at obj7 obj15)
   goals met: 2 of 7
40. (fly obj14 obj0 obj5)
   deleted: (at obj14 obj0)
   added: (at obj14 obj5)
   goals met: 2 of 7
41. (fly obj17 obj5 obj3)
   deleted: (at obj17 obj5)
   added: (at obj17 obj3)
   goals met: 2 of 7
42. (unload obj2 obj20 obj19)
   deleted: (in obj20 obj2)
   added: (at obj20 obj19)
   goals met: 3 of 7
43. (unload obj7 obj12 obj15)
   deleted: (in obj12 obj7)
   added: (at obj12 obj15)
   goals met: 4 of 7
44. (drive obj2 obj19 obj22)
   deleted: (at obj2 obj19)
   added: (at obj2 obj22)
   goals met: 4 of 7
45. (drive obj7 obj15 obj9)
   deleted: (at obj7 obj15)
   added: (at obj7 obj9)
   goals met: 4 of 7
46. (fly obj14 obj5 obj3)
   deleted: (at obj14 obj5)
   added: (at obj14 obj3)
   goals met: 4 of 7
47. (fly obj17 obj3 obj5)
   deleted: (at obj17 obj3)
   added: (at obj17 obj5)
   goals met: 4 of 7
48. (unload obj2 obj18 obj22)
   deleted: (in obj18 obj2)
   added: (at obj18 obj22)
   goals met: 5 of 7
49. (unload obj2 obj21 obj22)
   deleted: (in obj21 obj2)
   added: (at obj21 obj22)
   goals met: 6 of 7
50. (unload obj7 obj8 obj9)
   deleted: (in obj8 obj7)
   added: (at obj8 obj9)
   goals met: 7 of 7
